ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.h
/* ========================================= Start of section using anonymous unions ========================================= */

#include "compiler_abstraction.h"

#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Unsupported compiler type
#endif

/* =========================================================================================================================== */
/* ================                                  Peripheral Address Map                                  ================ */
/* =========================================================================================================================== */

#define NRF_SECURE_ICACHEDATA_S_BASE      0x01F00000UL
#define NRF_SECURE_ICACHEINFO_S_BASE      0x01F10000UL
#define NRF_SECURE_SICR_S_BASE            0x0E000000UL
#define NRF_SECURE_RICR_S_BASE            0x0FFFC000UL
#define NRF_SECURE_DCACHEDATA_S_BASE      0x21F00000UL
#define NRF_SECURE_DCACHEINFO_S_BASE      0x21F10000UL
#define NRF_SECURE_CRACENCORE_S_BASE      0x51800000UL
#define NRF_SECURE_MEMCONF200_NS_BASE     0xBF014000UL
#define NRF_SECURE_ETM_NS_BASE            0xE0041000UL
#define NRF_SECURE_CTI_S_BASE             0xE0042000UL
#define NRF_SECURE_CPUC_S_BASE            0xE0080000UL
#define NRF_SECURE_ICACHE_S_BASE          0xE0082000UL
#define NRF_SECURE_DCACHE_S_BASE          0xE0083000UL
#define NRF_SECURE_SPU000_S_BASE          0x51000000UL
#define NRF_SECURE_MPC000_S_BASE          0x51001000UL
#define NRF_SECURE_MVDMA_NS_BASE          0x41003000UL
#define NRF_SECURE_MVDMA_S_BASE           0x51003000UL
#define NRF_SECURE_RAMC000_S_BASE         0x51004000UL
#define NRF_SECURE_ROMC_NS_BASE           0x41005000UL
#define NRF_SECURE_ROMC_S_BASE            0x51005000UL
#define NRF_SECURE_CRACEN_S_BASE          0x51006000UL
#define NRF_SECURE_RAMC001_NS_BASE        0x41007000UL
#define NRF_SECURE_RAMC001_S_BASE         0x51007000UL
#define NRF_SECURE_PCGCS000_NS_BASE       0x5100A000UL
#define NRF_SECURE_PCGCS000_S_BASE        0x5100A000UL
#define NRF_SECURE_PCGCM000_S_BASE        0x5100B000UL
#define NRF_SECURE_HSFLL_NS_BASE          0x5100D000UL
#define NRF_SECURE_HSFLL_S_BASE           0x5100D000UL
#define NRF_SECURE_LRCCONF000_NS_BASE     0x5100E000UL
#define NRF_SECURE_LRCCONF000_S_BASE      0x5100E000UL
#define NRF_SECURE_PCGCM001_NS_BASE       0x5100F000UL
#define NRF_SECURE_PCGCM001_S_BASE        0x5100F000UL
#define NRF_SECURE_SPU010_S_BASE          0x51010000UL
#define NRF_SECURE_CPUCONF_NS_BASE        0x41011000UL
#define NRF_SECURE_CPUCONF_S_BASE         0x51011000UL
#define NRF_SECURE_MEMCONF_NS_BASE        0x41012000UL
#define NRF_SECURE_MEMCONF_S_BASE         0x51012000UL
#define NRF_SECURE_WDT010_NS_BASE         0x41014000UL
#define NRF_SECURE_WDT010_S_BASE          0x51014000UL
#define NRF_SECURE_WDT011_NS_BASE         0x41015000UL
#define NRF_SECURE_WDT011_S_BASE          0x51015000UL
#define NRF_SECURE_TAMPC_S_BASE           0x51016000UL
#define NRF_SECURE_MUTEX_NS_BASE          0x41017000UL
#define NRF_SECURE_MUTEX_S_BASE           0x51017000UL
#define NRF_SECURE_PCGCS010_NS_BASE       0x5101A000UL
#define NRF_SECURE_PCGCS010_S_BASE        0x5101A000UL
#define NRF_SECURE_PCGCM010_S_BASE        0x5101B000UL
#define NRF_SECURE_ABB_NS_BASE            0x5101C000UL
#define NRF_SECURE_ABB_S_BASE             0x5101C000UL
#define NRF_SECURE_LRCCONF010_NS_BASE     0x5101E000UL
#define NRF_SECURE_LRCCONF010_S_BASE      0x5101E000UL
#define NRF_SECURE_RESETINFO_S_BASE       0x5101E000UL
#define NRF_SECURE_PCGCM011_NS_BASE       0x5101F000UL
#define NRF_SECURE_PCGCM011_S_BASE        0x5101F000UL
#define NRF_SECURE_IPCT_NS_BASE           0x41013000UL
#define NRF_SECURE_IPCT_S_BASE            0x51013000UL
#define NRF_SECURE_SWI0_NS_BASE           0x42058000UL
#define NRF_SECURE_SWI1_NS_BASE           0x42059000UL
#define NRF_SECURE_SWI2_NS_BASE           0x4205A000UL
#define NRF_SECURE_SWI3_NS_BASE           0x4205B000UL
#define NRF_SECURE_SWI4_NS_BASE           0x4205C000UL
#define NRF_SECURE_SWI5_NS_BASE           0x4205D000UL
#define NRF_SECURE_SWI6_NS_BASE           0x4205E000UL
#define NRF_SECURE_SWI7_NS_BASE           0x4205F000UL
#define NRF_SECURE_BELLBOARD_NS_BASE      0x4F099000UL
#define NRF_SECURE_BELLBOARD_S_BASE       0x5F099000UL
#define NRF_SECURE_SPU310_S_BASE          0x59010000UL
#define NRF_SECURE_SPU410_S_BASE          0x5A010000UL
#define NRF_SECURE_MPC200_NS_BASE         0xBF007000UL
#define NRF_SECURE_SPU200_NS_BASE         0xBF000000UL
#define NRF_SECURE_SPU210_NS_BASE         0xBF010000UL
#define NRF_SECURE_CTRLAP_NS_BASE         0xBF015000UL
#define NRF_SECURE_SPU110_S_BASE          0x5F080000UL
#define NRF_SECURE_MPC110_S_BASE          0x5F081000UL
#define NRF_SECURE_SPU111_S_BASE          0x5F090000UL
#define NRF_SECURE_MPC111_S_BASE          0x5F091000UL
#define NRF_SECURE_SPU120_S_BASE          0x5F8C0000UL
#define NRF_SECURE_MPC120_S_BASE          0x5F8C1000UL
#define NRF_SECURE_SPU121_S_BASE          0x5F8D0000UL
#define NRF_SECURE_SPU122_S_BASE          0x5F8E0000UL
#define NRF_SECURE_SPU130_S_BASE          0x5F900000UL
#define NRF_SECURE_MPC130_S_BASE          0x5F901000UL
#define NRF_SECURE_SPU131_S_BASE          0x5F920000UL
#define NRF_SECURE_IPCMAP_S_BASE          0x5F923000UL
#define NRF_SECURE_IRQMAP_S_BASE          0x5F924000UL
#define NRF_SECURE_SPU132_S_BASE          0x5F980000UL
#define NRF_SECURE_SPU133_S_BASE          0x5F990000UL
#define NRF_SECURE_SPU134_S_BASE          0x5F9A0000UL
#define NRF_SECURE_SPU135_S_BASE          0x5F9B0000UL
#define NRF_SECURE_SPU136_S_BASE          0x5F9C0000UL
#define NRF_SECURE_SPU137_S_BASE          0x5F9D0000UL

/* =========================================================================================================================== */
/* ================                                  Peripheral Declaration                                  ================ */
/* =========================================================================================================================== */

#define NRF_SECURE_ICACHEDATA_S           ((NRF_ICACHEDATA_Type*)               NRF_SECURE_ICACHEDATA_S_BASE)
#define NRF_SECURE_ICACHEINFO_S           ((NRF_ICACHEINFO_Type*)               NRF_SECURE_ICACHEINFO_S_BASE)
#define NRF_SECURE_SICR_S                 ((NRF_SICR_Type*)                     NRF_SECURE_SICR_S_BASE)
#define NRF_SECURE_RICR_S                 ((NRF_RICR_Type*)                     NRF_SECURE_RICR_S_BASE)
#define NRF_SECURE_DCACHEDATA_S           ((NRF_DCACHEDATA_Type*)               NRF_SECURE_DCACHEDATA_S_BASE)
#define NRF_SECURE_DCACHEINFO_S           ((NRF_DCACHEINFO_Type*)               NRF_SECURE_DCACHEINFO_S_BASE)
#define NRF_SECURE_CRACENCORE_S           ((NRF_CRACENCORE_Type*)               NRF_SECURE_CRACENCORE_S_BASE)
#define NRF_SECURE_MEMCONF200_NS          ((NRF_MEMCONF_Type*)                  NRF_SECURE_MEMCONF200_NS_BASE)
#define NRF_SECURE_ETM_NS                 ((NRF_ETM_Type*)                      NRF_SECURE_ETM_NS_BASE)
#define NRF_SECURE_CTI_S                  ((NRF_CTI_Type*)                      NRF_SECURE_CTI_S_BASE)
#define NRF_SECURE_CPUC_S                 ((NRF_CM33SS_Type*)                   NRF_SECURE_CPUC_S_BASE)
#define NRF_SECURE_ICACHE_S               ((NRF_CACHE_Type*)                    NRF_SECURE_ICACHE_S_BASE)
#define NRF_SECURE_DCACHE_S               ((NRF_CACHE_Type*)                    NRF_SECURE_DCACHE_S_BASE)
#define NRF_SECURE_SPU000_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU000_S_BASE)
#define NRF_SECURE_MPC000_S               ((NRF_MPC_Type*)                      NRF_SECURE_MPC000_S_BASE)
#define NRF_SECURE_MVDMA_NS               ((NRF_MVDMA_Type*)                    NRF_SECURE_MVDMA_NS_BASE)
#define NRF_SECURE_MVDMA_S                ((NRF_MVDMA_Type*)                    NRF_SECURE_MVDMA_S_BASE)
#define NRF_SECURE_RAMC000_S              ((NRF_RAMC_Type*)                     NRF_SECURE_RAMC000_S_BASE)
#define NRF_SECURE_ROMC_NS                ((NRF_ROMC_Type*)                     NRF_SECURE_ROMC_NS_BASE)
#define NRF_SECURE_ROMC_S                 ((NRF_ROMC_Type*)                     NRF_SECURE_ROMC_S_BASE)
#define NRF_SECURE_CRACEN_S               ((NRF_CRACEN_Type*)                   NRF_SECURE_CRACEN_S_BASE)
#define NRF_SECURE_RAMC001_NS             ((NRF_RAMC_Type*)                     NRF_SECURE_RAMC001_NS_BASE)
#define NRF_SECURE_RAMC001_S              ((NRF_RAMC_Type*)                     NRF_SECURE_RAMC001_S_BASE)
#define NRF_SECURE_PCGCS000_NS            ((NRF_PCGCSLAVE_Type*)                NRF_SECURE_PCGCS000_NS_BASE)
#define NRF_SECURE_PCGCS000_S             ((NRF_PCGCSLAVE_Type*)                NRF_SECURE_PCGCS000_S_BASE)
#define NRF_SECURE_PCGCM000_S             ((NRF_PCGCMASTER_Type*)               NRF_SECURE_PCGCM000_S_BASE)
#define NRF_SECURE_HSFLL_NS               ((NRF_HSFLL_Type*)                    NRF_SECURE_HSFLL_NS_BASE)
#define NRF_SECURE_HSFLL_S                ((NRF_HSFLL_Type*)                    NRF_SECURE_HSFLL_S_BASE)
#define NRF_SECURE_LRCCONF000_NS          ((NRF_LRCCONF_Type*)                  NRF_SECURE_LRCCONF000_NS_BASE)
#define NRF_SECURE_LRCCONF000_S           ((NRF_LRCCONF_Type*)                  NRF_SECURE_LRCCONF000_S_BASE)
#define NRF_SECURE_PCGCM001_NS            ((NRF_PCGCMASTER_Type*)               NRF_SECURE_PCGCM001_NS_BASE)
#define NRF_SECURE_PCGCM001_S             ((NRF_PCGCMASTER_Type*)               NRF_SECURE_PCGCM001_S_BASE)
#define NRF_SECURE_SPU010_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU010_S_BASE)
#define NRF_SECURE_CPUCONF_NS             ((NRF_CPUCONF_Type*)                  NRF_SECURE_CPUCONF_NS_BASE)
#define NRF_SECURE_CPUCONF_S              ((NRF_CPUCONF_Type*)                  NRF_SECURE_CPUCONF_S_BASE)
#define NRF_SECURE_MEMCONF_NS             ((NRF_MEMCONF_Type*)                  NRF_SECURE_MEMCONF_NS_BASE)
#define NRF_SECURE_MEMCONF_S              ((NRF_MEMCONF_Type*)                  NRF_SECURE_MEMCONF_S_BASE)
#define NRF_SECURE_WDT010_NS              ((NRF_WDT_Type*)                      NRF_SECURE_WDT010_NS_BASE)
#define NRF_SECURE_WDT010_S               ((NRF_WDT_Type*)                      NRF_SECURE_WDT010_S_BASE)
#define NRF_SECURE_WDT011_NS              ((NRF_WDT_Type*)                      NRF_SECURE_WDT011_NS_BASE)
#define NRF_SECURE_WDT011_S               ((NRF_WDT_Type*)                      NRF_SECURE_WDT011_S_BASE)
#define NRF_SECURE_TAMPC_S                ((NRF_TAMPC_Type*)                    NRF_SECURE_TAMPC_S_BASE)
#define NRF_SECURE_MUTEX_NS               ((NRF_MUTEX_Type*)                    NRF_SECURE_MUTEX_NS_BASE)
#define NRF_SECURE_MUTEX_S                ((NRF_MUTEX_Type*)                    NRF_SECURE_MUTEX_S_BASE)
#define NRF_SECURE_PCGCS010_NS            ((NRF_PCGCSLAVE_Type*)                NRF_SECURE_PCGCS010_NS_BASE)
#define NRF_SECURE_PCGCS010_S             ((NRF_PCGCSLAVE_Type*)                NRF_SECURE_PCGCS010_S_BASE)
#define NRF_SECURE_PCGCM010_S             ((NRF_PCGCMASTER_Type*)               NRF_SECURE_PCGCM010_S_BASE)
#define NRF_SECURE_ABB_NS                 ((NRF_ABB_Type*)                      NRF_SECURE_ABB_NS_BASE)
#define NRF_SECURE_ABB_S                  ((NRF_ABB_Type*)                      NRF_SECURE_ABB_S_BASE)
#define NRF_SECURE_LRCCONF010_NS          ((NRF_LRCCONF_Type*)                  NRF_SECURE_LRCCONF010_NS_BASE)
#define NRF_SECURE_LRCCONF010_S           ((NRF_LRCCONF_Type*)                  NRF_SECURE_LRCCONF010_S_BASE)
#define NRF_SECURE_RESETINFO_S            ((NRF_RESETINFO_Type*)                NRF_SECURE_RESETINFO_S_BASE)
#define NRF_SECURE_PCGCM011_NS            ((NRF_PCGCMASTER_Type*)               NRF_SECURE_PCGCM011_NS_BASE)
#define NRF_SECURE_PCGCM011_S             ((NRF_PCGCMASTER_Type*)               NRF_SECURE_PCGCM011_S_BASE)
#define NRF_SECURE_IPCT_NS                ((NRF_IPCT_Type*)                     NRF_SECURE_IPCT_NS_BASE)
#define NRF_SECURE_IPCT_S                 ((NRF_IPCT_Type*)                     NRF_SECURE_IPCT_S_BASE)
#define NRF_SECURE_SWI0_NS                ((NRF_SWI_Type*)                      NRF_SECURE_SWI0_NS_BASE)
#define NRF_SECURE_SWI1_NS                ((NRF_SWI_Type*)                      NRF_SECURE_SWI1_NS_BASE)
#define NRF_SECURE_SWI2_NS                ((NRF_SWI_Type*)                      NRF_SECURE_SWI2_NS_BASE)
#define NRF_SECURE_SWI3_NS                ((NRF_SWI_Type*)                      NRF_SECURE_SWI3_NS_BASE)
#define NRF_SECURE_SWI4_NS                ((NRF_SWI_Type*)                      NRF_SECURE_SWI4_NS_BASE)
#define NRF_SECURE_SWI5_NS                ((NRF_SWI_Type*)                      NRF_SECURE_SWI5_NS_BASE)
#define NRF_SECURE_SWI6_NS                ((NRF_SWI_Type*)                      NRF_SECURE_SWI6_NS_BASE)
#define NRF_SECURE_SWI7_NS                ((NRF_SWI_Type*)                      NRF_SECURE_SWI7_NS_BASE)
#define NRF_SECURE_BELLBOARD_NS           ((NRF_BELLBOARD_Type*)                NRF_SECURE_BELLBOARD_NS_BASE)
#define NRF_SECURE_BELLBOARD_S            ((NRF_BELLBOARD_Type*)                NRF_SECURE_BELLBOARD_S_BASE)
#define NRF_SECURE_SPU310_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU310_S_BASE)
#define NRF_SECURE_SPU410_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU410_S_BASE)
#define NRF_SECURE_MPC200_NS              ((NRF_MPC_Type*)                      NRF_SECURE_MPC200_NS_BASE)
#define NRF_SECURE_SPU200_NS              ((NRF_SPU_Type*)                      NRF_SECURE_SPU200_NS_BASE)
#define NRF_SECURE_SPU210_NS              ((NRF_SPU_Type*)                      NRF_SECURE_SPU210_NS_BASE)
#define NRF_SECURE_CTRLAP_NS              ((NRF_CTRLAPPERI_Type*)               NRF_SECURE_CTRLAP_NS_BASE)
#define NRF_SECURE_SPU110_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU110_S_BASE)
#define NRF_SECURE_MPC110_S               ((NRF_MPC_Type*)                      NRF_SECURE_MPC110_S_BASE)
#define NRF_SECURE_SPU111_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU111_S_BASE)
#define NRF_SECURE_MPC111_S               ((NRF_MPC_Type*)                      NRF_SECURE_MPC111_S_BASE)
#define NRF_SECURE_SPU120_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU120_S_BASE)
#define NRF_SECURE_MPC120_S               ((NRF_MPC_Type*)                      NRF_SECURE_MPC120_S_BASE)
#define NRF_SECURE_SPU121_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU121_S_BASE)
#define NRF_SECURE_SPU122_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU122_S_BASE)
#define NRF_SECURE_SPU130_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU130_S_BASE)
#define NRF_SECURE_MPC130_S               ((NRF_MPC_Type*)                      NRF_SECURE_MPC130_S_BASE)
#define NRF_SECURE_SPU131_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU131_S_BASE)
#define NRF_SECURE_IPCMAP_S               ((NRF_IPCMAP_Type*)                   NRF_SECURE_IPCMAP_S_BASE)
#define NRF_SECURE_IRQMAP_S               ((NRF_IRQMAP_Type*)                   NRF_SECURE_IRQMAP_S_BASE)
#define NRF_SECURE_SPU132_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU132_S_BASE)
#define NRF_SECURE_SPU133_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU133_S_BASE)
#define NRF_SECURE_SPU134_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU134_S_BASE)
#define NRF_SECURE_SPU135_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU135_S_BASE)
#define NRF_SECURE_SPU136_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU136_S_BASE)
#define NRF_SECURE_SPU137_S               ((NRF_SPU_Type*)                      NRF_SECURE_SPU137_S_BASE)

/* =========================================================================================================================== */
/* ================                                    TrustZone Remapping                                    ================ */
/* =========================================================================================================================== */

